In [1]:
import pandas as pd

In [4]:
data = {
    'city' : ['서울', '경기', '제주', '부산'],
    'total1' : [12000, 34000, 50500, 42000],
    'total2' : [12500, 38000, 150000, 37000]
}

# 데이터 프레임 생성
df = pd.DataFrame(data)
df

  city  total1  total2
0   서울   12000   12500
1   경기   34000   38000
2   제주   50500  150000
3   부산   42000   37000

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   city    4 non-null      object
 1   total1  4 non-null      int64
 2   total2  4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [6]:
df.dtypes

city      object
total1     int64
total2     int64
dtype: object

In [7]:
df.city

0    서울
1    경기
2    제주
3    부산
Name: city, dtype: object

In [11]:
type(df.city)
# 'O' -> object
df.city.dtype

dtype('O')

In [12]:
df.total1.dtype

dtype('int64')

In [13]:
# 컬럼 total2
df.sort_values('total2')

  city  total1  total2
0   서울   12000   12500
3   부산   42000   37000
1   경기   34000   38000
2   제주   50500  150000

In [15]:
# [문제] 컬럼 total2의 값을 내림차순 정렬, 원본 적용

df.sort_values('total2', 
               ascending=False, 
               inplace=True)
df

  city  total1  total2
2   제주   50500  150000
1   경기   34000   38000
3   부산   42000   37000
0   서울   12000   12500

In [17]:
# [인덱스] 오름차순 
df.sort_index()

  city  total1  total2
2   제주   50500  150000
1   경기   34000   38000
3   부산   42000   37000
0   서울   12000   12500

In [18]:
# [인덱스] 내림차순
df.sort_index(ascending=False)

  city  total1  total2
3   부산   42000   37000
2   제주   50500  150000
1   경기   34000   38000
0   서울   12000   12500

In [22]:
# 인덱스 재설정
df.reset_index()

   index city  total1  total2
0      2   제주   50500  150000
1      1   경기   34000   38000
2      3   부산   42000   37000
3      0   서울   12000   12500

In [23]:
# 기존 인덱스 삭제 후 인덱스 재설정하고 복사본 생성
df.reset_index(drop=True)

  city  total1  total2
0   제주   50500  150000
1   경기   34000   38000
2   부산   42000   37000
3   서울   12000   12500

In [26]:
# 기존 인덱스 삭제 후 새로운 인덱스를 추가하고 원본 적용
df.reset_index(drop=True, inplace=True)
df

  city  total1  total2
0   제주   50500  150000
1   경기   34000   38000
2   부산   42000   37000
3   서울   12000   12500

In [27]:
# 컬럼
# 열의 인덱스
df.columns

Index(['city', 'total1', 'total2'], dtype='object')

In [32]:
# total1의 컬럼명을 총합1로 변경
df.rename(columns={'total1' : '총합1'}, inplace=True)
df

  city    총합1  total2
0   제주  50500  150000
1   경기  34000   38000
2   부산  42000   37000
3   서울  12000   12500

In [34]:
# 조건에 맞는 데이터 추출(행)
# 1) 지역이 서울인 데이터만 추출
# df.loc[df.city == '서울']
df[df.city == '서울']

  city    총합1  total2
3   서울  12000   12500

In [36]:
# 2) 총합 1의 값이 50,000 이상인 데이터 추출
# df.loc[df.총합1 >= 50000]
df[df.총합1 >= 50000]

  city    총합1  total2
0   제주  50500  150000

In [50]:
# 3) 총합1과 total2 모두 50000 이상인 데이터 추출
# df.loc[:,['총합1', 'total2']] >= 50000
# & : and
# | : or
df[(df.총합1 >= 50000) & (df.total2 >= 50000)]

  city    총합1  total2
0   제주  50500  150000

In [61]:
# 4) city에서 산이 포함된 데이터 추출
# Series.str : 시리즈에 문자열 함수를 사용할 수 있게 타입을 바꿔주는 함수
df[df.city.str.contains('산')]

pandas.core.strings.accessor.StringMethods